Tekla Open API Reference for Tekla Structures 2025
SectionMarkTagsAttributes Constructor
Overload List
Name | Description
SectionMarkBase.SectionMarkTagsAttributes()
 Creates a new mark tags attributes instance.
SectionMarkBase.SectionMarkTagsAttributes(SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes, SectionMarkBase.SectionMarkTagAttributes)
 Creates a new mark tags attributes instance.
Top
See Also
Reference
SectionMarkBase.SectionMarkTagsAttributes Class
Tekla.Structures.Drawing Namespace